Revit 2024 API
Space.CalculatedHeatingLoad Property
Get the Calculated Heating Load of the Space.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public double CalculatedHeatingLoad { get; }
Visual Basic
Public ReadOnly Property CalculatedHeatingLoad As Double
	Get
Visual C++
public:
property double CalculatedHeatingLoad {
	double get ();
}
Remarks
This property is used to get the Calculated Heating Load of the Space.
See Also
Space Class
Autodesk.Revit.DB.Mechanical Namespace